{{{header(rdb,Richard Westhaver,ellis@rwest.io)}}}

The =rdb= cli tool is a simple RocksDB management utility.

* help
#+begin_src shell :results pp replace
rdb -h
#+end_src

#+RESULTS:
: rdb v0.1.0
:   usage: rdb [global] <command> [<arg>]
: 
:   richard's database
:   options:
:      -l/--level* :  set the log level
:      -h/--help* :  print help
:      -v/--version* :  print version
:   commands:
